// Задание 1
// Создайте функцию которая возводит переданное число в куб, необходимо вывести в консоль результат 2^3 степени + 3 ^ 3 степени
// function tripple(params) {
//   return params ** 3
// }
// console.log(` ${tripple(2) + tripple(3)} `);





// Задание 2
// Пользователь вводит с клавиатуры число, если ввёл текст, необходимо вывести что значение задано неверно
// Создать фукнцию, которая высчитывает 13% от данного числа и выводит в консоль текст "Размер заработной платы за вычетом налогов равен значение"

// let salary = number => number * 0.87;
// let number = Number(prompt(`Введите число`));
// if (number * 0 != 0) {
//   console.log(`значение задано неверно`)
// } else {
//   console.log(`Размер заработной платы за вычетом налогов равен значение ${salary(number)}`)
// }


// Задание 3
// Пользователь с клавиатуры вводит 3 числа, необходимо создать функцию, которая определяет максимальное значение среди этих чисел


// function GetMax(num1,num2,num3) {
//   let maxNumber = num1
//   if (num2 >= num1 && num2 >= num3) {
//     maxNumber = num2
//   } else  if (num3 >= num2 && num3>= num1) {
//     maxNumber = num3
//   } 
//   console.log(maxNumber)
// }
// let num1 = Number(prompt(`Введите число`));
// let num2 = Number(prompt(`Введите число`));
// let num3 = Number(prompt(`Введите число`));
// GetMax(num1 , num2 , num3)


// Задание 4
// Необходимо реализовать четыре функции, каждая функция должна принимать по два числа и выполнять одну из операций (каждая функция выполняет одну из них):
// 1. Сложение
// 2. Разность
// 3. Умножение
// 4. Деление
// Необходимо сделать так, чтобы функция вернула число, например выражение console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция сложения в данном примере, ваши названия функций могут отличаться). Округлять значения, которые возвращают функции не нужно, однако, обратите внимание на разность, функция должна вычесть из большего числа меньшее, либо вернуть 0, если числа равны. Функциям всегда передаются корректные числа, проверки на NaN, Infinity делать не нужно

let sum = (num1,num2) => num1 + num2;
function minus(num1,num2) {
  if (num1 >= num2) {
    return num1 - num2;
  } else 
    return num2 - num1;
  }
let multiple = (num1,num2) => num1 * num2;
let div = (num1,num2) => num1 / num2;
console.log(`сумма = ${sum(2,6)}`);
console.log(`разность = ${minus(2,6)}`);
console.log(`произведение= ${multiple(2,6)}`);
console.log(` деление =${div(2,6)}`)